package com.qtone.gy.enums;

/**
 * 公共返回码定义 1-1000
 */
public enum CommonResultEnum implements BaseResultEnum {
	/**
	 * 请求成功
	 */
	SUCCESS(200, "成功"), 
	/**
	 * 请求失败
	 */
	BAD_REQUEST(400, "请求失败!"), 
	/**
	 * 请求无权限
	 */
	NOTAUTHORIZATION(401, "请求无权限"),
	/**
	 * 您的账号已在别处登录，请重新登陆
	 */
	NOTAUTHORIZATION_402(402, "您的账号已在别处登录，请重新登陆"),
	/**
	 * 请求地址不存在
	 */
	NO_ERROR(404, "请求地址不存在"),
	
	/**
	 * 不可接受的访问 
	 */
	NOT_ACCEPTABLE(406, "不可接受的访问"), 
	
	/**
	 * 服务器发生异常
	 */
	SERVER_ERROR(500, "服务器发生异常"),

	/**
	 * 系统异常
	 */
	COMMON_ERROR_601(601, "系统异常"),
	/**
	 * 缺少参数或值为空
	 */
	COMMON_ERROR_602(602,"缺少参数或值为空或参数不合法"),
	
	/**
	 * 参数{0}不能为空
	 */
	COMMON_ERROR_603(603,"参数{0}不能为空"),
	/**
	 * 参数{0}无效
	 */
	COMMON_ERROR_604(604,"参数{0}无效"),
	/**
	 * {0}数据不存在,合并到604
	 */
	//COMMON_ERROR_605(605,"{0}数据不存在"),
	
	/**
	 * token超时
	 * 合并到401错误
	 */
	//COMMON_ERROR_606(606,"token超时"),
	/**
	 * 607
	 * {0}数据已存在
	 */
	COMMON_ERROR_607(607,"{0}数据已存在"),
	
	/**
	 * 更新密码时原密码不正确
	 */
	COMMON_ERROR_609(609,"原密码不正确"),
	
	/**
	 * 更新密码时两次输入的不一致
	 */
	COMMON_ERROR_610(610,"两次密码不一致"),
	
	/**
	 * 用户未登录
	 * 合并到401错误
	 */
	//COMMON_ERROR_611(611,"用户未登录"),
	
	
	/**
	 * 用户未注册
	 */
	/*COMMON_ERROR_612(612,"用户未注册"),*/
	
	/**
	 * 用户密码不能为空
	 */
	COMMON_ERROR_613(613,"用户密码不能为空"),
	/**
	 * 验证码错误
	 */
	VERIFICODE_ERROR_614(614, "验证码错误"),
	/**
	 * 用户名或密码错误
	 */
	COMMON_ERROR_615(615,"用户名或密码错误"),
	/**
	 * 账户被冻结,用户是停用状态（useStatus：1）
	 */
	COMMON_ERROR_617(617,"账户被冻结"),
	
	/**
	 * 该账号超过有效期
	 */
	COMMON_ERROR_617_1(617,"该账号超过有效期"),
	
	/**
	 * 手机号码格式错误
	 */
	COMMON_ERROR_616(616,"手机号码格式错误"),
	/**
	 * 手机号未注册，请联系学校管理员
	 */
	COMMON_ERROR_618(618,"手机号未注册，请联系学校管理员"),
	/**
	 * 密码输入错误，请重新输入
	 */
	COMMON_ERROR_619(619,"密码输入错误，请重新输入"),
	/**
	 * 文件大小超出限制
	 */
	COMMON_ERROR_620(620,"文件大小不能超过20M"),
	/**
	 * 密钥错误
	 */
	COMMON_ERROR_621(621,"{0}密钥错误"),
	/**
	 * 当前家长没有关联的学生，不能登录
	 */
	COMMON_ERROR_622(622,"当前家长没有关联的学生，不能登录"),
	/**
	 * 保存成功
	 */
	COMMON_ERROR_631(631,"保存成功"),
	
	
	/**
	 * 保存失败
	 */
	COMMON_ERROR_632(632,"保存失败"),
	
	
	/**
	 * 提交成功
	 */
	COMMON_ERROR_633(633,"提交成功"),
	
	/**
	 * 提交失败
	 */
	COMMON_ERROR_634(634,"提交失败"),
	
	/**
	 * 删除成功
	 */
	COMMON_ERROR_635(635,"删除成功"),
	
	/**
	 * 删除失败
	 */
	COMMON_ERROR_636(636,"删除失败"),
	/**
	 * 操作失败
	 */
	COMMON_ERROR_637(637,"操作失败"),
	/**
	 * 参数无效
	 */
	COMMON_ERROR_638(638,"参数无效"),
	
	/**
	 * 参数{0}长度超出限制
	 */
	COMMON_ERROR_640(640,"参数{0}长度超出限制"),
	
	/**
	 * 数量超出限制
	 */
	COMMON_ERROR_641(641,"{0}数量超出限制"),
	
	/**
	 * 文件不存在
	 */
	COMMON_ERROR_642(642,"文件不存在"),
	
	/**
	 * 文件不合法
	 */
	COMMON_ERROR_643(643,"文件不合法"),
	
	/**
	 * 预设{0}数量不能超过5个
	 */
	COMMON_ERROR_644(644,"预设{0}数量不能超过5个"),
	
	/**
	 * 主观题没有选项统计
	 */
	COMMON_ERROR_645(645,"主观题没有选项统计"),
	
	/**
	 * 当前班级已设置该学科教材,请不要重复设置
	 */
	COMMON_ERROR_646(646,"当前班级已设置该学科教材,请不要重复设置"),
	
	/**
	 * 该班级仅绑定了一个课程，不允许删除，如有疑问请联系客服或管理员
	 */
	COMMON_ERROR_647(647,"该班级仅绑定了一个课程，不允许删除，如有疑问请联系客服或管理员"),
	
	/**
	 * 教师无该班级权限，请检查后重试！
	 */
	COMMON_ERROR_648(648,"教师无该班级权限，请检查后重试！"),
	
	/**
	 * 催交作业：作业已经催交
	 */
	COMMON_ERROR_651(651,"作业已经催交,今日不能重复催交！"),
	/**
	 * 催交作业：作业催交失败
	 */
	COMMON_ERROR_652(652,"作业催交失败"),
	/**
	 * 催交作业：学生作业已经全部提交
	 */
	COMMON_ERROR_654(654,"学生作业已经全部提交"),
	
	/**
	 * 查询SQL异常
	 */
	COMMON_ERROR_660(660,"查询SQL异常"),
	
	/**
	 * 资源下载额度用完
	 */
	COMMON_ERROR_661(661,"资源更新中，请明日下载"),
	
	/**
	 * 教师作业发布次数上限提示
	 */
	COMMON_ERROR_666(666,"您今日的发布次数已达上限"),
	
	/**
	 * 新增字段 添加错题本错误
	 */
	COMMON_ERROR_667(667,"错题加入错题本失败！"),
	
	/**
	 * 新增字段  学生的题未批改完
	 */
	COMMON_ERROR_668(668,"当前作业单中的:{0}仍未批改,继续提交后将做0分处理，是否继续?"),
	
	/**
	 * 目前还没有学生对题目进行
	 */
	COMMON_ERROR_669(669,""),
	
	/**
	 * 保存作业试卷失败
	 */
	COMMON_ERROR_1201(1201,"保存作业试卷失败"),
	
	/**
	 * 保存作业失败，作业必须包含试卷，文档，任务，链接4个中的一项
	 */
	COMMON_ERROR_1202(1202,"保存作业失败，作业必须包含试卷，文档，任务，链接4个中的一项"),
	/**
	 * 当前学生的作业状态不是待提交，所以不能提交作业
	 */
	COMMON_ERROR_1203(1203,"学生当前的作业状态不是待提交，所以无法提交作业"),
	/**
	 * 作业已过截止时间，不允许提交作业
	 */
	COMMON_ERROR_1204(1204,"作业已过截止时间，不允许提交作业"),
	
	/**
	 * 作业截止时间必须大于当前时间
	 */
	COMMON_ERROR_1205(1205,"作业发布截止时间必须大于当前时间"),
	
	/**
	 * 前台传班级圈的文件名和文件url数量不匹配
	 */
	COMMON_ERROR_1301(1301,"班级圈表的url数量跟文件名数量不匹配"),

	/**
	 * 不允许收藏自己创建的试卷
	 */
	COMMON_ERROR_1310(1310, "不允许收藏自己创建的试卷"),

	/**
	 * 请求的班级id或作业id不存在
	 */
	COMMON_ERROR_1401(1401,"请求的班级id或作业id不存在"),
	/**
	 * 学生添加好友失败，没有找出学生所在班级的老师
	 */
	COMMON_ERROR_1501(1501,"学生添加好友失败，没有找出学生所在班级的老师"),
	/**
	 * 老师添加好友失败，老师所带班级为空
	 */
	COMMON_ERROR_1502(1502,"老师添加好友失败，老师所带班级为空"),
	/**
	 * 老师删除好友失败，老师所带班级下没有学生
	 */
	COMMON_ERROR_1503(1503,"老师删除好友失败，老师所带班级下没有学生"),
	/**
	 * 学生删除好友失败，学生没有加入群组,无法删除群组所对应班级的老师好友
	 */
	COMMON_ERROR_1504(1504,"学生删除好友失败，学生没有加入群组，无法删除群组所对应班级的老师好友"),
	/**
	 * 请求链接无效
	 */
	COMMON_ERROR_1601(1601,"链接无效"),
	/**
	 * 2201参数无效，{0}分数超过题目分数
	 */
	COMMON_ERROR_2201(2201,"参数无效，{0}分数超过题目分数"),
	
	/**
	 * 不是自评作业，不能提交
	 */
	COMMON_ERROR_2210(2210,"不是自评作业，不能提交"),
	
	/**
	 * JSON转换异常,请联系管理员！
	 */
	JSON_CONVERT_EXCEPTION(998,"JSON转换异常,请联系管理员"),
	
	/**
	 * 参数空指针错误，请联系管理员!
	 */
	PARAMETER_NULL_EXCEPTION(997,"参数空指针错误，请联系管理员!"),
	
	/**
	 * 获取ip地址异常
	 */
	UNKNOWNHOST_EXCEPTION(1501,"获取ip地址异常"),
	
	/**
	 * 登录失败e次,输入验证码
	 */
	LOGIN_EXCEPTION_IMPORT_VERIFICATION_2001(2001,"登录失败次数过多,请输入验证码"),
	
	/**
	 * 登录失败f次,用户已锁定
	 */
	LOGIN_EXCEPTION_USER_LOCK_2002(2002,"多次登录失败,用户已锁定,请{0}小时后再登录");
	
	
	
	private int code;

	private String msg;

	CommonResultEnum(int code, String msg) {
		this.code = code;
		this.msg = msg;
	}

	public int getCode() {
		return code;
	}

	public String getMsg() {
		return msg;
	}
	
}
